
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар КАК Товар,
		|	ОстаткиТоваровОстатки.Склад КАК Склад,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Ссылка КАК Ссылка,
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	ПродажаТовараСписокТоваров.Количество КАК Количество,
		|	ПродажаТовараСписокТоваров.Склад КАК Склад
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажа
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажа.Количество КАК Количество,
		|	ОстаткиТоваровОстатки.Товар КАК Товар1,
		|	ОстаткиТоваровОстатки.Склад КАК Склад1,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ВременнаяТаблицаПродажа КАК ВременнаяТаблицаПродажа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ПО (ОстаткиТоваровОстатки.Товар = ВременнаяТаблицаПродажа.Товар)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", СписокТоваров.Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	НедостатокТовара = Выборка.ОстаткиТоваровОстатки.Товар - Выборка.ВременнаяТаблицаПродажа.Товар;
	
	Пока Выборка.Следующий() Цикл
		Если НедостатокТовара < 0 Тогда
		  Отказ = Истина;
		  Сообщить("Недостаточно товара " + Выборка.СписокТоваров.Товар + " в кол-ве" + -НедостатокТовара );
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Склад = ТекСтрокаСписокТоваров.Склад;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;

КонецПроцедуры
